package Tasks;

// СДЕЛАТЬ ЧТО-ТО: ВЫРАЖЕНИЯ: объявления, присваивания, вызовы методов ...
public class Expression {
    public static void main(String[] args) {
        int x = 7; // ОБЪЯВЛЕНИЕ целочисленной переменной с типом (Int) и с именем (Х)
        String name = "Кинжалов"; // Объявляем строковую переменную с именем (name) и
        // и ПРИСВАИВАЕМ ей значение (Кинжалов)
        x = x * 17; // Умножаем 7 на 17
        System.out.print( x ); // и ПРИСВАИВАЕМ результат переменной (Х) с именем.


    }
}

