package Tasks;

// ПРОСТЫЕ ЛОГИЧЕСКИЕ ПРОВЕРКИ.
public class Logika {
    public static void main(String[] args) {
        int x = 4; // Присваеваем х значение 4
        while (x > 3) {
            // Код в цикле будет работать, так как
            // х больше, чем 3
            x = x - 1;
            System.out.println(x == 3);
            // или цикл будет выполняться вечно
        }


    }
}
// Простые логические проверки:
// < (меньше чем);
// > (больше чем);
// == (равенство) два символа оператор сравнения
// = оператор присваивания.