package Tasks;
// ПРОСТЫЕ ЛОГИЧЕСКИЕ ПРОВЕРКИ.
public class Logika {
    public static void main(String[] args) {
        int x = 4; // Присваеваем х значение 4
        while (x > 3) {
            // Код в цикле будет работать, так как
            // х больше, чем 3
            x = x -1;
            // или цикл будет выполняться вечно
        }
        int z = 27;
        while (z == 17) {
            // Код цикла не будет запущен, так как
            // z не равно 17
        }
    }
}
// Простые логические проверки:
// < (меньше чем);
// > (больше чем);
// == (равенство) два символа оператор сравнения
// = оператор присваивания.L